Sv3n01/Project_1_Code/bl602_demo_wifi/bl602_demo_wifi/main.c
static void __attribute__((unused)) cmd_aws(char *buf, int len, int argc, char **argv)
{
void aws_main_entry(void *arg);
    xTaskCreate(aws_main_entry, (char*)"aws_iot", 4096, NULL, 10, NULL);
}

static void cmd_pka(char *buf, int len, int argc, char **argv)
{
    bl_pka_test();
}

static void cmd_wifi(char *buf, int len, int argc, char **argv)
{
void mm_sec_keydump(void);
    mm_sec_keydump();
}

static void cmd_sha(char *buf, int len, int argc, char **argv)
{
    bl_sec_sha_test();
}

static void cmd_trng(char *buf, int len, int argc, char **argv)
{
    bl_sec_test();
}

static void cmd_aes(char *buf, int len, int argc, char **argv)
{
    bl_sec_aes_test();
}

static void cmd_cks(char *buf, int len, int argc, char **argv)
{
    bl_cks_test();
}

static void cmd_dma(char *buf, int len, int argc, char **argv)
{
    bl_dma_test();
}

static void cmd_exception_load(char *buf, int len, int argc, char **argv)
{
    bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_LOAD_MISALIGN, (void*)0x22008001);
}

static void cmd_exception_l_illegal(char *buf, int len, int argc, char **argv)
{
    bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_ACCESS_ILLEGAL, (void*)0x00200000);
}

static void cmd_exception_store(char *buf, int len, int argc, char **argv)
{
    bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_STORE_MISALIGN, (void*)0x22008001);
}

static void cmd_exception_illegal_ins(char *buf, int len, int argc, char **argv)
{
    bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_ILLEGAL_INSTRUCTION, (void*)0x22008001);
}

#define MAXBUF          128
#define BUFFER_SIZE     (12*1024)

//allocatedMemory is start address of the audio file
//memory length in bytes (allocatedMemory)
static int client_demo(uint8_t *allocatedMemory, int lengthInBytes)
{
    int sockfd;
    /* Get host address from the input name */
    //struct hostent *hostinfo = gethostbyname(hostname);
    uint8_t *recv_buffer;

    /*if (!hostinfo) {
        printf("gethostbyname Failed\r\n");
        return -1;
    }*/

    struct sockaddr_in dest;

    char buffer[MAXBUF];
    /* Create a socket */
    /*---Open socket for streaming---*/
    if ((sockfd = socket(AF_INET, SOCK_STREAM, 0)) < 0) {
        printf("Error in socket\r\n");
        return -1;
    }

    /*---Initialize server address/port struct---*/
    memset(&dest, 0, sizeof(dest));
    dest.sin_family = AF_INET;
    dest.sin_port = htons(PORT);
    //dest.sin_addr = *((struct in_addr *) hostinfo->h_addr);
    dest.sin_addr.s_addr = inet_addr(MY_IP);
    //    char ip[16];
    uint32_t address = dest.sin_addr.s_addr;
    char *ip = inet_ntoa(address);

    printf("Server ip Address : %s\r\n", ip);
    /*---Connect to server---*/
    if (connect(sockfd,
             (struct sockaddr *)&dest,
             sizeof(dest)) != 0) {
        printf("Error in connect\r\n");
        return -1;
    }
    /*---Get "Hello?"---*/
    memset(buffer, 0, MAXBUF);
    //Content-Type: audio/wav
    //char wbuf[] = "POST /auth HTTP/1.1\r\nHost: ourvoiceproject1.serveo.net\r\nUser-Agent: wmsdk\r\nAccept: */*\r\nContent-Length: 13\r\n\r\n\x48\x65\x6c\x6c\x6f\x2c\x20\x57\x6f\x72\x6c\x64\x21";
    //"POST /byteTest HTTP/1.1\r\nHost: example.com\r\nourvoiceproject1.serveo.net\r\nContent-Type: application/octet-stream\r\nContent-Length: 13\r\n\r\n\x48\x65\x6c\x6c\x6f\x2c\x20\x57\x6f\x72\x6c\x64\x21";
    //"POST /test-file HTTP/1.1\r\nHost: ourvoiceproject1.serveo.net\r\nUser-Agent: wmsdk\r\nAccept: */*\r\nContent-Type: multipart/form-data; boundary=----Boundary1234567890\r\nContent-Length: <calculated_content_length>\r\n\r\n------Boundary1234567890\r\nContent-Disposition: form-data; name=\"file\"; filename=\"test.txt\"\r\ntext/plain\r\n\r\n\x68\x65\x6c\x6c\x6f\r\n------Boundary1234567890--\r\n";
    //"GET /test HTTP/1.1\r\nHost: ourvoiceproject1.serveo.net\r\nUser-Agent: wmsdk\r\nAccept: */*\r\n\r\n";

    //write(sockfd, wbuf, sizeof(wbuf) - 1);
    for(int i=0;i<200;i++){
        printf("%c",allocatedMemory[i]);
    }
    write(sockfd, allocatedMemory, lengthInBytes - 1);

    int ret = 0;
    int total = 0;
    int debug_counter = 0;
    uint32_t ticks_start, ticks_end, time_consumed;

    ticks_start = xTaskGetTickCount();
    recv_buffer = pvPortMalloc(BUFFER_SIZE);
    if (NULL == recv_buffer) {
        printf("OUT OD MEMORY\r\n");
        goto out;
    }
    //ret = amount of received bytes (last is null byte)
    ret = read(sockfd, recv_buffer, BUFFER_SIZE);
    printf("\n\rReceive Buffer = %s\n\r",recv_buffer);
    
    int contentIndex = 0;
    for(int i=0;i<BUFFER_SIZE;i++){
        if(recv_buffer[i] == 'r' && recv_buffer[i+1] == 'e' && recv_buffer[i+2] == 's' && recv_buffer[i+3] == ':'){
            contentIndex = i+4;
            break;
        }
    }

    char response = recv_buffer[contentIndex];

    /*Arduino response command
    printf("%c",'\r');
    printf("%c",'\r');
    printf("%c",'\r');*/
    if(response == '1' || response == 1){
        bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
            LED_GREEN,             //  GPIO pin number
            1                 //  0 for low, 1 for high
        );
        bl_pwm_set_duty(SERVO_PWM_CHANNEL, 13);//3 close, 13 open
        vTaskDelay(5000);
        bl_pwm_set_duty(SERVO_PWM_CHANNEL, 3);//3 close, 13 open
        bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
            LED_GREEN,             //  GPIO pin number
            0                 //  0 for low, 1 for high
        );

        printf("Success: %c",response); 
    } else {
        bl_pwm_set_duty(SERVO_PWM_CHANNEL, 3);//3 close, 13 open
        bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
            LED_RED,             //  GPIO pin number
            1                 //  0 for low, 1 for high
        );
        vTaskDelay(3000);
        bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
            LED_RED,             //  GPIO pin number
            0                 //  0 for low, 1 for high
        );

        printf("Failed: %c",response);
    }

