Sv3n01/Project_1_Code/bl602_demo_wifi/bl602_demo_wifi/main.c
    /* Pass out a pointer to the StaticTask_t structure in which the Timer
    task's state will be stored. */
    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

    /* Pass out the array that will be used as the Timer task's stack. */
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;

    /* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
    Note that, as the array is necessarily of type StackType_t,
    configTIMER_TASK_STACK_DEPTH is specified in words, not bytes. */
    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}

void vAssertCalled(void)
{
    volatile uint32_t ulSetTo1ToExitFunction = 0;

    taskDISABLE_INTERRUPTS();
    while( ulSetTo1ToExitFunction != 1 ) {
        __asm volatile( "NOP" );
    }
}

static void _dump_boot_info(void)
{
    char chip_feature[40];
    const char *banner;

    puts("Booting BL602 Chip...\r\n");

    /*Display Banner*/
    if (0 == bl_chip_banner(&banner)) {
        puts(banner);
    }
    puts("\r\n");
    /*Chip Feature list*/
    puts("\r\n");
    puts("------------------------------------------------------------\r\n");
    puts("RISC-V Core Feature:");
    bl_chip_info(chip_feature);
    puts(chip_feature);
    puts("\r\n");

    puts("Build Version: ");
    puts(BL_SDK_VER); // @suppress("Symbol is not resolved")
    puts("\r\n");

    puts("PHY   Version: ");
    puts(BL_SDK_PHY_VER); // @suppress("Symbol is not resolved")
    puts("\r\n");

    puts("RF    Version: ");
    puts(BL_SDK_RF_VER); // @suppress("Symbol is not resolved")
    puts("\r\n");

    puts("Build Date: ");
    puts(__DATE__);
    puts("\r\n");

    puts("Build Time: ");
    puts(__TIME__);
    puts("\r\n");
    puts("------------------------------------------------------------\r\n");

}

static void system_init(void)
{
    blog_init();
    bl_irq_init();
    bl_sec_init();
    bl_sec_test();
    bl_dma_init();
    hal_boot2_init();

    /* board config is set after system is init*/
    hal_board_cfg(0);
}

static void system_thread_init()
{
    /*nothing here*/
}

//MAIN CODE
static void proc_hellow_entry(void *pvParameters)
{
    int rc = bl_uart_init(
        0,  //  UART Port
        16,          //  Tx Pin (Blue)
        7,          //  Rx Pin (Yellow)
        255,        //  CTS Unused
        255,        //  RTS Unused
        115200      //  Baud Rate
    );

    bl_gpio_enable_output(
        ARDUINO_TRIGGER_PIN,  //  GPIO pin number
        0,         //  No GPIO pullup
        0          //  No GPIO pulldown
    );
    bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
        ARDUINO_TRIGGER_PIN,             //  GPIO pin number
        1                 //  0 for low, 1 for high
    );

    bl_gpio_enable_output(
        LED_GREEN,  //  GPIO pin number
        0,         //  No GPIO pullup
        0          //  No GPIO pulldown
    );
    bl_gpio_enable_output(
        LED_RED,  //  GPIO pin number
        0,         //  No GPIO pullup
        0          //  No GPIO pulldown
    );
    bl_gpio_enable_output(
        LED_YELLOW,  //  GPIO pin number
        0,         //  No GPIO pullup
        0          //  No GPIO pulldown
    );

    bl_gpio_enable_input(
        BUTTON_PIN,  //  GPIO pin number
        1,         //  No GPIO pullup
        0          //  No GPIO pulldown
    );

    bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
        LED_YELLOW,             //  GPIO pin number
        1                 //  0 for low, 1 for high
    );

    //servo init
    bl_pwm_init(SERVO_PWM_CHANNEL, SERVO_PIN, PWM_FREQUENCY);
    PWM_Channel_Set_Div(SERVO_PWM_CHANNEL, PWM_FREQUENCY_DIVIDER);
    bl_pwm_set_duty(SERVO_PWM_CHANNEL, 3);//3 close, 13 open
    bl_pwm_start(SERVO_PWM_CHANNEL);

    vTaskDelay(500);
    wifi_sta_connect(WIFI_SSID,WIFI_PASSWORD);

    vTaskDelay(10000);

    printf("!!!READY!!!");
    bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
        LED_YELLOW,             //  GPIO pin number
        0                 //  0 for low, 1 for high
    );

    int response;

    while(1){
        TickType_t startTime = 0, endTime;

         // Allocate 20 bytes of memory using pvPortMalloc
        uint8_t *allocatedMemory = pvPortMalloc(50000);

        if (allocatedMemory != NULL) {
            // Memory allocation successful

            //pass button signal to arduino
            bool isRecording = false;
            while(1){
                int buttonState = bl_gpio_input_get_value(BUTTON_PIN);
                if(buttonState == 0 && !isRecording){
                    printf("%s","Start recording\r\n");
                    isRecording = true;
                    bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
                        ARDUINO_TRIGGER_PIN,             //  GPIO pin number
                        0                 //  0 for low, 1 for high
                    );
                    bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
                        LED_YELLOW,             //  GPIO pin number
                        1                 //  1 == button not pressed, 0 == button pressed
                    );
                } else if(buttonState == 1 && isRecording){
                    printf("%s","Stop recording\r\n");
                    isRecording = false;
                    bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
                        LED_YELLOW,             //  GPIO pin number
                        0                 //  1 == button not pressed, 0 == button pressed
                    );
                    bl_gpio_output_set(  //  Set the GPIO output (from BL602 GPIO HAL)
                        ARDUINO_TRIGGER_PIN,             //  GPIO pin number
                        1                 //  0 for low, 1 for high
                    );
                    break;
                }
                vTaskDelay(10);
            }

            //wait for start command
            int startCommandCounter = 0;
            while(startCommandCounter < 4){
                while(1){
                    response = bl_uart_data_recv(0);
                    if(response < 0){continue;}
                    else {break;}
                }
                if(response == '\r'){
                    startCommandCounter++;
                } else {
                    startCommandCounter = 0;
                }
            }

            //get the file size as string
            char *contentLengthBuff = pvPortMalloc(10);
            if(contentLengthBuff == NULL){
                printf("%s","contentLength OUT OF MEMORY");
                vTaskDelete(NULL);
            }
            int digitIndex = 0;
            while(1){
                response = bl_uart_data_recv(0);
                if(response < 0){continue;}
                if(response == '\r'){
                    break;
                }
                if(response >= 48 && response <= 57){//numbers
                    contentLengthBuff[digitIndex] = response;
                    digitIndex++;
                }
            }
            char contentLength[digitIndex + 1];
            for(int i=0;i<digitIndex;i++){
                contentLength[i] = contentLengthBuff[i];
            }
            contentLength[digitIndex] = '\0';//so printf knows where to stop

            //construct buffer with http header + data from serial
            char *httpHeader = pvPortMalloc(500);
            if(httpHeader == NULL){
                printf("%s","httpHeader OUT OF MEMORY");
                vTaskDelete(NULL);
            }
            sprintf(httpHeader,"POST /auth HTTP/1.1\r\nHost: ourvoiceproject1.loca.lt\r\nUser-Agent: wmsdk\r\nAccept: */*\r\nbypass-tunnel-reminder: 1\r\nContent-Length: %s\r\n\r\n",contentLength);//data comes directly at the end
            //sprintf(httpHeader,"POST /auth HTTP/1.1\r\nHost: ourvoiceproject1.serveo.net\r\nUser-Agent: wmsdk\r\nAccept: */*\r\nContent-Length: %s\r\n\r\n",contentLength);//data comes directly at the end
            //char httpHeader[] = "POST /auth HTTP/1.1\r\nHost: ourvoiceproject1.serveo.net\r\nUser-Agent: wmsdk\r\nAccept: */*\r\nContent-Length: 13\r\n\r\n";
            
