Sv3n01/Project_1_Code/bl602_demo_wifi/bl602_demo_wifi/main.c
            //count http header length
            int httpHeaderLength = 0;
            int newLineCount = 0;
            int carriageCount = 0;
            for(int i=0;i<500;i++){
                if(httpHeader[i] == '\n'){
                    newLineCount++;
                } else if(httpHeader[i] == '\r'){
                    carriageCount++;
                } else {
                    newLineCount = 0;
                    carriageCount = 0;
                }

                httpHeaderLength++;

                if(newLineCount == 2 && carriageCount == 2){//detect end of header
                    break;
                }
            }

            //fill the final buffer
            for(int i=0;i<httpHeaderLength;i++){
                allocatedMemory[i] = httpHeader[i];
            }

            free(contentLengthBuff);
            free(httpHeader);
            
            //add the incoming file data to the buffer
            int step = httpHeaderLength;//start index of buffer
            int contentLengthReal = 0;
            while(1){
                response = bl_uart_data_recv(0);
                if(response < 0){
                    if(startTime == 0){
                        startTime = xTaskGetTickCount();
                    }
                    endTime = xTaskGetTickCount();
                    TickType_t elapsedTime = endTime - startTime;
                    uint32_t elapsedTimeMillis = pdMS_TO_TICKS(elapsedTime);
                    if(elapsedTimeMillis >= 1000){
                        startTime = 0;
                        break;
                    }
                    continue;
                }
                startTime = 0;
                allocatedMemory[step] = response;
                step++;
                contentLengthReal++;
            }

            //add null byte
            allocatedMemory[step] = '\0';
            step++;
            contentLengthReal++;

            printf("\r\ncontentLengthReal = %d\r\n",contentLengthReal);//to compare with header content-length

            //process file
            //file is now contained from allocatedMemory[0] to allocatedMemory[step-1]
            client_demo(allocatedMemory, step);//step is the length of the allocatedMemory in bytes
            /*for(int i=0;i<step;i++){
                response = allocatedMemory[i];
                bl_uart_data_send(0, response);
            }*/

            vPortFree(allocatedMemory);
        } else {
            // Memory allocation failed
            // Handle the failure
            printf("%s","allocatedMemory OUT OF MEMORY");
            vTaskDelete(NULL);
        }    
    }

    vTaskDelete(NULL);
}

void bfl_main()
{
    static StackType_t aos_loop_proc_stack[1024];
    static StaticTask_t aos_loop_proc_task;
    static StackType_t proc_hellow_stack[512];
    static StaticTask_t proc_hellow_task;

    time_main = bl_timer_now_us();
    /*Init UART In the first place*/
    bl_uart_init(0, 16, 7, 255, 255, 115200);
    puts("Starting bl602 now....\r\n");

    _dump_boot_info();

    vPortDefineHeapRegions(xHeapRegions);
    printf("Heap %u@%p, %u@%p\r\n",
            (unsigned int)&_heap_size, &_heap_start,
            (unsigned int)&_heap_wifi_size, &_heap_wifi_start
    );
    printf("Boot2 consumed %lums\r\n", time_main / 1000);

    system_init();
    system_thread_init();

    puts("[OS] Starting proc_hellow_entry task...\r\n");
    xTaskCreateStatic(proc_hellow_entry, (char*)"hellow", 512, NULL, 15, proc_hellow_stack, &proc_hellow_task);
    puts("[OS] Starting aos_loop_proc task...\r\n");
    xTaskCreateStatic(aos_loop_proc, (char*)"event_loop", 1024, NULL, 15, aos_loop_proc_stack, &aos_loop_proc_task);
    puts("[OS] Starting TCP/IP Stack...\r\n");
    tcpip_init(NULL, NULL);

    puts("[OS] Starting OS Scheduler...\r\n");
    vTaskStartScheduler();
}
